In [2]:
# importing required packages
import pandas as pd
import numpy as np

## Pandas Obect
- Series(1D) - homogeneous
- DataFrame (2D) - hetrogeneous where each column will homogeneous / mutable / indices (features) and columns (observation)
- panel (3d) - 3D data, mutable

In [3]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017], 
            'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [5]:
df.loc[1:2,'Year':'Points']

   Year  Points
1  2015     789
2  2014     863

In [6]:
df.loc[1:2,:] # return all column

     Team  Rank  Year  Points
1  Riders     2  2015     789
2  Devils     2  2014     863

In [9]:
df.loc[[1,2], ['Year','Points']]

   Year  Points
1  2015     789
2  2014     863

In [10]:
df.loc[[1,2]]

     Team  Rank  Year  Points
1  Riders     2  2015     789
2  Devils     2  2014     863

In [12]:
##
df = pd.DataFrame(data = [[1,2],[2,3],[3,4]],
                 index = ['a','b','c'],
                 columns = ['c1','c2'])

In [13]:
df

   c1  c2
a   1   2
b   2   3
c   3   4

In [15]:
df.loc[['b']]

   c1  c2
b   2   3

### Using iloc

In [16]:
df.iloc[1:2,1:2]

   c2
b   3

In [17]:
df.iloc[[1],[1]]

   c2
b   3

In [21]:
df['c1']

a    1
b    2
c    3
Name: c1, dtype: int64

In [23]:
df[['c1','c2']]

   c1  c2
a   1   2
b   2   3
c   3   4

In [25]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017], 
            'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [26]:
df.Year == 2015

0     False
1      True
2     False
3      True
4     False
5      True
6     False
7     False
8     False
9     False
10     True
11    False
Name: Year, dtype: bool

In [27]:
#select all records for 2015 year
df[df.Year == 2015]

      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    Kings     4  2015     812
10  Royals     1  2015     804

In [28]:
#select the records for 2015 and team Riders

exp = (df.Year == 2015) & (df.Team == 'Riders')

In [31]:
df[exp]

     Team  Rank  Year  Points
1  Riders     2  2015     789

In [32]:
df[(df.Year == 2015) & (df.Team == 'Riders')]

     Team  Rank  Year  Points
1  Riders     2  2015     789

In [38]:
#select point for 2015 and Riders

df[(df.Year == 2015) & (df.Team == 'Riders')][['Points']]

   Points
1     789

In [34]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

### Groupby (aggregation, Transformation, Filter)

In [40]:
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [48]:
## splitting data on Team
groups = df.groupby(by = ['Team'])

In [49]:
groups = df.groupby(by = 'Team')

In [50]:
groups.groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 5, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64')}

In [51]:
#  Aggregation

In [ ]:
# 'Points' averagte for each team

In [53]:
df.groupby('Team')['Points'].mean()

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Points, dtype: float64

In [55]:
df.groupby('Team')[['Points']].mean()

        Points
Team
Devils  768.00
Kings   774.25
Riders  762.25
Royals  752.50

In [56]:
df.head(2)

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789

In [ ]:
# 'Points' : averagte, 'Range': maximum.. for each team

In [57]:
df.groupby('Team')[['Points']].mean()
df.groupby('Team')[['Rank']].max()

        Rank
Team
Devils     3
Kings      4
Riders     2
Royals     4

In [65]:
df.groupby('Team')[['Points','Rank']].agg({'points':'mean', 'Rank':max})

        points         Rank
        Points  Rank Points Rank
Team
Devils  768.00  2.50    863    3
Kings   774.25  2.25    812    4
Riders  762.25  1.75    876    2
Royals  752.50  2.50    804    4

In [66]:
## transformation
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [79]:
df['Points'].mean()

765.5833333333334

In [82]:
df['points_var']= (df['Points']- df['Points'].mean())

In [86]:
df

      Team  Rank  Year  Points  points_var
0   Riders     1  2014     876  110.416667
1   Riders     2  2015     789   23.416667
2   Devils     2  2014     863   97.416667
3   Devils     3  2015     673  -92.583333
4    Kings     3  2014     741  -24.583333
5    Kings     4  2015     812   46.416667
6    Kings     1  2016     756   -9.583333
7    Kings     1  2017     788   22.416667
8   Riders     2  2016     694  -71.583333
9   Royals     4  2014     701  -64.583333
10  Royals     1  2015     804   38.416667
11  Riders     2  2017     690  -75.583333

In [87]:
df.groupby('Team')[['Points']].mean()

        Points
Team
Devils  768.00
Kings   774.25
Riders  762.25
Royals  752.50

In [88]:
# df['points_var_l']= df['Points']- df.groupby('Team')[['Points']].mean()

df['points_var_l'] = df.groupby('Team')['Points'].transform(lambda x: x - np.mean(x))

In [90]:
df.head()

     Team  Rank  Year  Points  points_var  points_var_l
0  Riders     1  2014     876  110.416667        113.75
1  Riders     2  2015     789   23.416667         26.75
2  Devils     2  2014     863   97.416667         95.00
3  Devils     3  2015     673  -92.583333        -95.00
4   Kings     3  2014     741  -24.583333        -33.25

In [91]:
## filter

In [93]:
df.groupby('Team').filter(lambda x: len(x)==2)

      Team  Rank  Year  Points  points_var  points_var_l
2   Devils     2  2014     863   97.416667          95.0
3   Devils     3  2015     673  -92.583333         -95.0
9   Royals     4  2014     701  -64.583333         -51.5
10  Royals     1  2015     804   38.416667          51.5

In [94]:
df.apply('mean',axis=0)

Rank            2.166667e+00
Year            2.015167e+03
Points          7.655833e+02
points_var     -3.789561e-14
points_var_l    0.000000e+00
dtype: float64

In [95]:
df.apply('mean',axis=1)

0     623.033333
1     571.233333
2     614.283333
3     500.683333
4     540.033333
5     583.033333
6     549.033333
7     568.433333
8     514.433333
9     520.583333
10    581.983333
11    512.233333
dtype: float64

In [106]:
df['Team_num'] = df['Team'].applyymap(lambda x: 0 if x=='Riders' (1 if x=='Devils' (2 if x=='Kings' else 3)))

SyntaxError: invalid syntax (<ipython-input-106-b50684352e16>, line 1)

In [100]:
df

      Team  Rank  Year  Points  points_var  points_var_l
0   Riders     1  2014     876  110.416667        113.75
1   Riders     2  2015     789   23.416667         26.75
2   Devils     2  2014     863   97.416667         95.00
3   Devils     3  2015     673  -92.583333        -95.00
4    Kings     3  2014     741  -24.583333        -33.25
5    Kings     4  2015     812   46.416667         37.75
6    Kings     1  2016     756   -9.583333        -18.25
7    Kings     1  2017     788   22.416667         13.75
8   Riders     2  2016     694  -71.583333        -68.25
9   Royals     4  2014     701  -64.583333        -51.50
10  Royals     1  2015     804   38.416667         51.50
11  Riders     2  2017     690  -75.583333        -72.25